ibytergj/client-sdk-esp32/components/livekit/examples/custom_hardware_s31/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
# Increase UDP receive buffering to tolerate bursty audio delivery
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64

# --- Credentials ---
# See README.md for setup instructions. Keep real credentials in the generated
# sdkconfig, which is ignored by Git.
# CONFIG_LK_EXAMPLE_USE_SANDBOX=y
# CONFIG_LK_EXAMPLE_SANDBOX_ID="my-project-xxxxxx"
CONFIG_LK_EXAMPLE_USE_PREGENERATED=y
CONFIG_LK_EXAMPLE_SERVER_URL="ws://localhost:7880"
# CONFIG_LK_EXAMPLE_TOKEN="your-jwt-token"

# --- Example board profile ---
CONFIG_LK_CUSTOM_S31_BOARD_KORVO=y
CONFIG_LK_EXAMPLE_SPEAKER_VOLUME=85

# --- LiveKit SDK and ESP32-S31 settings ---
CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_WS_CLIENT_ENABLE_DYNAMIC_BUFFER=y
CONFIG_ESP_WS_CLIENT_SEPARATE_TX_LOCK=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y
# ESP-IDF 6.1 disables X.509 certificate creation by default; esp_peer needs
# it to generate the self-signed DTLS-SRTP certificate.
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_SSL_DTLS_SRTP=y
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=8192
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ESP-IDF 6.1 disables the S31 flasher stub by default. esptool 5.3.1 includes
# an S31 v2 stub, enabling compressed and substantially faster downloads.
# CONFIG_ESPTOOLPY_NO_STUB is not set
